routes/web.php

select * from `branches`
select * from `roles`
---
    })->name('dashboard');
});

Route::prefix('/super-admin')->middleware([
    'auth:sanctum',
    config('jetstream.auth_session'),
    'verified',
    'super_admin'
])->group(function () {
    Route::get('/dashboard',function(){
        return view('super-admin.dashboard');
    })->name('super-admin.dashboard');

    Route::get('/branches',function(){
        return view('super-admin.branches');
    })->name('super-admin.branches');

    Route::get('/users',function(){
        $roles=Role::all();
        $branches=Branch::all();
        return view('super-admin.users',[
            'roles'=>$roles,
            'branches'=>$branches,
        ]);
    })->name('super-admin.users');