app/Http/Livewire/SuperAdmin/Users/Edit.php

select * from `users` where `id` = 1 limit 1
---
    public function edit_user_handler($id)
    {
        $this->selected_user=User::where('id',$id)->first();