app/Http/Livewire/SuperAdmin/Users/Table.php

    public function render()
    {
        return view('livewire.super-admin.users.table',[
            'users'=>User::query()
                        ->where('name','like','%'.$this->search.'%')
                        ->when($this->branchFilter,function($query){
                            return $query->where('branch_id',$this->branchFilter);
                        })
                        ->with(['role'])
                        ->paginate(10)
        ]);
---
select * from `roles` where `roles`.`id` in (1, 2)
select * from `users` where `name` like '%%' and `branch_id` like '%%' limit 10 offset 0
select count(*) as aggregate from `users` where `name` like '%%' and `branch_id` like '%%'

    public function confirmDelete()
    {
        $user = User::where('id',$this->selected_user_id)->first();
        $user->delete();
---
select * from `users` where `id` = 2 limit 1
delete from `users` where `id` = 2