app/Http/Livewire/SuperAdmin/Branches/Table.php

select * from `branches` where `name` like '%%' limit 10 offset 0
select count(*) as aggregate from `branches` where `name` like '%%'
---
    public function render()
    {
        return view('livewire.super-admin.branches.table',[
            'branches'=>Branch::where('name','like','%'.$this->search.'%')->paginate(10)
        ]);